InformationRegisters/Renault_ДополнительныеПараметрыСменыАвтосервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ДополнительныеПараметрыСменыАвтосервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикРаботКалендарный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботКалендарный</Name>
			<Comment>График работ календарный</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Comment>Вид дня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДня</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Банковский</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Comment>Вид интервала</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнтервалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Comment>График</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Comment>Начало рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецРабочегоВремени</Name>
					<Comment>Конец рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Comment>Смена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_КлассификацияОтделов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_КлассификацияОтделов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтделПродажАвтомобилей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделПродажЗапасныхЧастей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделКорпоративныхПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделТрейдИн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделReception</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделКузовногоРемонта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидДня</Name>
			<Comment>Вид дня</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>Предпраздничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>Праздник</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выходной</Name>
					<Comment>Выходной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
					<Comment>Сотрудник находится в командировке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Смены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Смены</Name>
			<Comment>Смены</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Интервалы</Name>
					<Comment>Интервалы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоРабочегоВремени</Name>
							<Comment>Начало рабочего времени</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецРабочегоВремени</Name>
							<Comment>Конец рабочего времени</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИнтервала</Name>
							<Comment>Вид интервала</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыИнтервалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Comment>Продолжительность</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/CRM_Отделы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_Отделы</Name>
			<Comment>Содержит список отделов с указанием входящих в отдел подразделений</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПродажаАвтомобилей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрендМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентскаяСлужба</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификацияRenault</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_КлассификацияОтделов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьВСписки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПервичныйИнтерес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Renault_ДополнительныеПараметрыСменыАвтосервиса/Forms/ЗаполнениеИнтерваловПриемки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЦветРабочий=Новый Цвет(255,255,255);
	ЦветНеРабочий=Новый Цвет(213,213,213);
	ЦветАктивный=Новый Цвет(201,230,246);
	ШиринаИнтервала=4;
	ПериодРегистра=ТекущаяДата();
	Периодичность=?(ДилерскийЦентр.ДлительностьПриемки=0,15,ДилерскийЦентр.ДлительностьПриемки);
	ДилерскийЦентр=Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	СформироватьИнтервалы();
	//ЗаполнитьПоРегистру();
КонецПроцедуры

Процедура ПолучитьСмены(Дата)
	
	//смены - выборка различные за месяц по дилеру
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДЦ",ДилерскийЦентр);
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	Запрос.Текст="
	|Выбрать
	|	Ссылка Смена,
	|	НачалоРабочегоВремени ВремяНачала, 
	|	КонецРабочегоВремени ВремяОкончания 
	|Поместить Смены
	|Из Справочник.Смены.Интервалы
	|ГДЕ Ссылка В(
		|ВЫБРАТЬ
		|	ГрафикРК.Смена
		|ИЗ(
		|	ВЫБРАТЬ Сотрудник
		|	ИЗ(ВЫБРАТЬ Ссылка Сотрудник ИЗ Справочник.Сотрудники)СотрудникиДЦ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ(
		|		ВЫБРАТЬ
		|			Ссылка.ДилерскийЦентр ДЦ,
		|			Подразделение
		|		ИЗ Справочник.CRM_Отделы.Подразделения
		|	ГДЕ Ссылка.КлассификацияRenault=ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделСервиса)
		|	)ПодразделенияДЦ
		|	ПО СотрудникиДЦ.Сотрудник.Подразделение=ПодразделенияДЦ.Подразделение
			
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ(
		|		ВЫБРАТЬ
		|			Ссылка.ДилерскийЦентр ДЦ,
		|			Должность
		|		ИЗ Справочник.CRM_Отделы.Должности
		|		ГДЕ Ссылка.КлассификацияRenault=ЗНАЧЕНИЕ(Перечисление.CRM_КлассификацияОтделов.ОтделСервиса)
		|	)ДолжностиДЦ
		|	ПО СотрудникиДЦ.Сотрудник.Должность=ДолжностиДЦ.Должность
		
		|	ГДЕ ДолжностиДЦ.ДЦ=&ДЦ
		|)СотрудникиОтделСервиса
			
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный ГрафикРК
		|ПО СотрудникиОтделСервиса.Сотрудник.ГрафикРаботы=ГрафикРК.График
			
		|ГДЕ
		|	ГрафикРК.ВидДня=ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)
		|	И ГрафикРК.ВидИнтервала=ЗНАЧЕНИЕ(Справочник.ВидыИнтервалов.Работа)
		|	И ГрафикРК.Дата МЕЖДУ &Дата1 И &Дата2

		|СГРУППИРОВАТЬ ПО ГрафикРК.Смена
	|)
	|	 И ВидИнтервала=Значение(Справочник.ВидыИнтервалов.Работа)
	//|Упорядочить По Ссылка,ВремяНачала
	|;
	|Выбрать Минимум(ВремяНачала) ГраницаНачала, Максимум(ВремяОкончания) ГраницаОкончания Из Смены 
	|;
	|Выбрать Смена,ВремяНачала,ВремяОкончания Из Смены Упорядочить По Смена.Наименование, ВремяНачала   
	|";
	Пакет=Запрос.ВыполнитьПакет();
	
	//границы графика
	Стр=Пакет[1].Выгрузить()[0];
	ГраницаНачала=Стр.ГраницаНачала;
	ГраницаОкончания=?(Стр.ГраницаОкончания='00010101000000',НачалоДня(Стр.ГраницаНачала)+3600*24,КонецЧаса(Стр.ГраницаОкончания)+1);
	
	//смены
	ТЗ=Пакет[2].Выгрузить();
	Смены.Очистить();
	Для Каждого Стр Из ТЗ Цикл
		СтрСмены=Смены.Добавить();
		ЗаполнитьЗначенияСвойств(СтрСмены,Стр);
		СтрСмены.ВремяОкончания=КорректировкаДатыОкончания(Стр.ВремяОкончания); //поправим косяк 23:59:59
	КонецЦикла;	
	
	////разобьем рабочее время на интервалы
	//НормализованнаяТаблица=ТЗ.СкопироватьКолонки();
	//Для Каждого Стр ИЗ ТЗ Цикл
	//	ТекПериод=Стр.ВремяНачала;
	//	Пока ТекПериод+Периодичность*60<=Стр.ВремяОкончания Цикл
	//		НСтр=НормализованнаяТаблица.Добавить();	
	//		НСтр.Смена=Стр.Смена;
	//		НСтр.ВремяНачала=ТекПериод;
	//		НСтр.ВремяОкончания=ТекПериод+Периодичность*60;
	//		ТекПериод=ТекПериод+Периодичность*60;
	//	КонецЦикла;	
	//	
	//	//добавим последнюю запись (с косяком 23:59:59)
	//	Если ТекПериод+Периодичность*60<=КорректировкаДатыОкончания(Стр.ВремяОкончания) Тогда
	//		НСтр=НормализованнаяТаблица.Добавить();	
	//		НСтр.Смена=Стр.Смена;
	//		НСтр.ВремяНачала=ТекПериод;
	//		НСтр.ВремяОкончания=ТекПериод+Периодичность*60-1;
	//		ТекПериод=ТекПериод+Периодичность*60;
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	
	//Смены.Загрузить(НормализованнаяТаблица);
	
	//Запрос=Новый Запрос;
	//Запрос.УстановитьПараметр("ДЦ",ДилерскийЦентр);
	//Запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	//Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	//Запрос.Текст="
	//|Выбрать
	//|	ГрафикРК.Смена,
	//|	Минимум(НачалоРабочегоВремени) ВремяНачала,
	//|	Максимум(КонецРабочегоВремени) ВремяОкончания
	//|ИЗ(

	//|	Выбрать
	//|		СотрудникиДЦ.ДЦ,
	//|		СотрудникиДЦ.Сотрудник
	//|	ИЗ(	
	//	//сотрудники ДЦ
	//|		Выбрать 
	//|			ДЦ.Ссылка ДЦ,
	//|			Сотрудники.Ссылка Сотрудник
	//|		Из Справочник.CRM_ДилерскиеЦентры ДЦ 
	//|		Левое Соединение Справочник.Сотрудники Сотрудники 
	//|		По ДЦ.Организация=Сотрудники.Организация
	//|	)СотрудникиДЦ

	//	//подразделения ДЦ
	//|	Внутреннее Соединение(
	//|		Выбрать 
	//|			Ссылка.ДилерскийЦентр ДЦ,
	//|			Подразделение
	//|		Из Справочник.CRM_Отделы.Подразделения 
	//|		ГДЕ Ссылка.КлассификацияRenault=Значение(Перечисление.CRM_КлассификацияОтделов.ОтделСервиса)
	//|	)ПодразделенияДЦ
	//|	По 
	//|		СотрудникиДЦ.ДЦ=ПодразделенияДЦ.ДЦ 
	//|		И СотрудникиДЦ.Сотрудник.Подразделение=ПодразделенияДЦ.Подразделение

	//	//Должности ДЦ
	//|	Внутреннее Соединение(
	//|		Выбрать 
	//|			Ссылка.ДилерскийЦентр ДЦ,
	//|			Должность
	//|		Из Справочник.CRM_Отделы.Должности 
	//|		ГДЕ Ссылка.КлассификацияRenault=Значение(Перечисление.CRM_КлассификацияОтделов.ОтделСервиса)
	//|	)ДолжностиДЦ
	//|	По 
	//|		СотрудникиДЦ.ДЦ=ДолжностиДЦ.ДЦ 
	//|		И СотрудникиДЦ.Сотрудник.Должность=ДолжностиДЦ.Должность
	//		
	//|)СотрудникиОтделСервиса
	//|Левое Соединение РегистрСведений.ГрафикРаботКалендарный ГрафикРК
	//|По СотрудникиОтделСервиса.Сотрудник.ГрафикРаботы=ГрафикРК.График

	//|ГДЕ 
	//|	ВидДня=Значение(Перечисление.ВидДня.Рабочий)
	//|	И ВидИнтервала=Значение(Справочник.ВидыИнтервалов.Работа)
	//|	И СотрудникиОтделСервиса.ДЦ=&ДЦ
	//|	И Дата Между &Дата1 И &Дата2

	//|Сгруппировать По
	//|	СотрудникиОтделСервиса.ДЦ,
	//|	ГрафикРК.Смена,
	//|	НачалоПериода(Дата,Месяц)
	//
	//|Упорядочить По ГрафикРК.Смена.Наименование	
	//|";
	//Возврат Запрос.Выполнить().Выгрузить()
КонецПроцедуры	

&НаКлиенте
Процедура кнОбновить(Команда) СформироватьИнтервалы(Истина) КонецПроцедуры

&НаКлиенте
Процедура ДилерскийЦентрПриИзменении(Элемент) СформироватьИнтервалы() КонецПроцедуры
&НаКлиенте
Процедура ПериодичностьРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь; 
	Периодичность=Периодичность+Направление; 
	СформироватьИнтервалы(Истина);
КонецПроцедуры
&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент) СформироватьИнтервалы(Истина) КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистраПриИзменении(Элемент) СформироватьИнтервалы(Истина) КонецПроцедуры
&НаКлиенте
Процедура ПериодРегистраРегулирование(Элемент, Направление, СтандартнаяОбработка) СформироватьИнтервалы() КонецПроцедуры

Процедура СформироватьИнтервалы(Перезаполнить=Ложь)
	
	ТаблОтметок=СобратьОтметки();
	Если Перезаполнить или ТаблОтметок.Количество()=0 Тогда //это вызов по кнопке "обновить" - перезаполнить ТаблицаРегистра из РегистраСведений
		Запрос=Новый Запрос("Выбрать Смена,ВремяНачала Из РегистрСведений.Renault_ДополнительныеПараметрыСменыАвтосервиса ГДЕ ДилерскийЦентр=&ДилерскийЦентр");
		Запрос.УстановитьПараметр("ДилерскийЦентр",ДилерскийЦентр);
		ТаблОтметок=Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
	
	ПолучитьСмены(ТекущаяДата());
	СоотвСменИСтрок=Новый Соответствие;
	
	Элементы.ШиринаИнтервала.Заголовок="Масштаб: "+(ШиринаИнтервала-1)+"x";
	
	//очистка ТабличногоДокумента
	Интервалы.Очистить();
	Интервалы.Область("T").ЦветФона=ЦветаСтиля.ЦветФонаФормы;
	Элементы.Интервалы.ТекущаяОбласть=Интервалы.Область("R2C2");
	
	ТЗ=Смены.Выгрузить(,"Смена");
	ТЗ.Свернуть("Смена");
	МассивСмен=ТЗ.ВыгрузитьКолонку("Смена");
	МаксДлинаСтрСмены=0; Для Каждого Смена Из МассивСмен Цикл МаксДлинаСтрСмены=Макс(МаксДлинаСтрСмены,СтрДлина(Смена.Наименование)) КонецЦикла;
	МаксДлинаСтрСмены=МаксДлинаСтрСмены*0.7;
	
	//шкала времени
	ШиринаЭдиницыШкалы=30*(ШиринаИнтервала/Периодичность); //ширина 30 мин.
	//ШиринаЧаса=ШиринаИнтервала/Периодичность*60;
	//ШиринаЭдиницыШкалы=ШиринаЧаса/2;
	
	ТекПериод=ГраницаНачала;
	ВсегоЧасов=(ГраницаОкончания-ТекПериод)/3600;
	
	СплошнаяЛиния=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ПунктирнаяЛиния=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Точечная,1);
	
	ТекКолонка=2;
	ТекПериод=ГраницаНачала;
	
	Интервалы.Область("R3").СоздатьФорматСтрок();
	//Интервалы.Область("R3C2:R3C60").СоздатьФорматСтрок();
	Интервалы.Область("R3C2").ШиринаКолонки=ШиринаЭдиницыШкалы/2;
	Интервалы.Область("R3C1").ШиринаКолонки=МаксДлинаСтрСмены; //ширина колонки смены
	Интервалы.Область("R2C1").ШиринаКолонки=МаксДлинаСтрСмены; //ширина колонки смены
	Интервалы.Область("R3").ВысотаСтроки=6;
	
	Пока (ТекПериод+Периодичность)<=ГраницаОкончания+30*60 Цикл
		
		Обл=Интервалы.Область("R2C"+Формат(ТекКолонка,"ЧГ=0"));
		Обл.Текст=ФорматВремени(ТекПериод);
		Обл.ШиринаКолонки=ШиринаЭдиницыШкалы;
		Обл.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;
		Обл.ВертикальноеПоложение=ВертикальноеПоложение.Центр;
		Обл.ГраницаСнизу=СплошнаяЛиния;
		
		Если ТекПериод<=ГраницаОкончания Тогда
			Обл=Интервалы.Область("R3C"+Формат(ТекКолонка+1,"ЧГ=0"));
			Обл.ШиринаКолонки=ШиринаЭдиницыШкалы;
			Обл.ГраницаСлева=?(Минута(ТекПериод)=30,ПунктирнаяЛиния,СплошнаяЛиния);
		КонецЕсли;	
		
		ТекКолонка=ТекКолонка+1;
		ТекПериод=ТекПериод+30*60;
		
	КонецЦикла;
	
	//смены
	ТекСтрока=5;
	Для Каждого Смена Из МассивСмен Цикл
		
		СоотвСменИСтрок.Вставить(ТекСтрока,Смена);
		
		Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C1").Текст=Смена;
		Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C1").ВертикальноеПоложение=ВертикальноеПоложение.Центр;
		//Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C2:R"+Формат(ТекСтрока,"ЧГ=0")+"C60").СоздатьФорматСтрок();
		Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")).СоздатьФорматСтрок();
		Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C2").ШиринаКолонки=ШиринаЭдиницыШкалы/2;
		Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C2").ВысотаСтроки=25;
		Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C1").ШиринаКолонки=МаксДлинаСтрСмены; //ширина колонки смены
		
		ТекКолонка=3;
		ТекПериод=ГраницаНачала;
		//Пока (ТекПериод+Периодичность*60)<=ГраницаОкончания Цикл
		Пока (ТекПериод+Периодичность*60/2)<=ГраницаОкончания Цикл 
			
			Обл=Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C"+Формат(ТекКолонка,"ЧГ=0"));
			//Обл.Текст=ТекКолонка;
			Обл.ШиринаКолонки=ШиринаИнтервала;
			
			//ищем отметку
			//ЕстьОтметка=ВхождениеИнтервала(Смена,ТекПериод);
			
			ЕстьОтметка=Ложь;
			Для Каждого СтрСмены Из ТаблОтметок.НайтиСтроки(Новый Структура("Смена",Смена)) Цикл
				Если (ТекПериод-СтрСмены.ВремяНачала)<Периодичность*60 И (СтрСмены.ВремяНачала+Периодичность-ТекПериод)<=Периодичность*60 Тогда 
					ЕстьОтметка=Истина;
					Прервать
				КонецЕсли;
			КонецЦикла;
			
			//если отметки нет определим рабочий/выходной
			Если ЕстьОтметка Тогда
				ЦветФона=ЦветАктивный;	
			Иначе
				ЕстьРабота=ВхождениеИнтервалаСмены(Смена,ТекПериод);
				ЦветФона=?(ЕстьРабота,ЦветРабочий,ЦветНеРабочий);
			КонецЕсли;
			
			Обл.ЦветФона=ЦветФона;
			
			Если ЕстьРабота Тогда
				Обл.ГраницаСверху=ПунктирнаяЛиния;
				Обл.ГраницаСнизу=ПунктирнаяЛиния;
				Обл.ГраницаСлева=ПунктирнаяЛиния;
				Обл.ГраницаСправа=ПунктирнаяЛиния;
			КонецЕсли;	
			
			ТекКолонка=ТекКолонка+1;
			ТекПериод=ТекПериод+Периодичность*60;	
		КонецЦикла;		
		
		ТекСтрока=ТекСтрока+2; //через строку
	КонецЦикла;	
	
	СоответствиеСменИСтрок=ЗначениеВСтрокуВнутр(СоотвСменИСтрок);
	
КонецПроцедуры	

Функция ФорматВремени(Время) Возврат Формат(Час(Время),"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0")+":"+Формат(Минута(Время),"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0") КонецФункции	

&НаКлиенте
Процедура ИнтервалыПриАктивизацииОбласти(Элемент)
	СвоВа=СвойстваЯчейки(Элемент.ТекущаяОбласть.Верх,Элемент.ТекущаяОбласть.Право);
	Если СвоВа=Неопределено Тогда Возврат КонецЕсли;
	СвоВа.Вставить("Рабочий",ВхождениеИнтервалаСмены(СвоВа.Смена,СвоВа.ВремяНачала));
	Элемент.ТекущаяОбласть.ЦветФона=?(Элемент.ТекущаяОбласть.ЦветФона=ЦветАктивный, ?(СвоВа.Рабочий,ЦветРабочий,ЦветНеРабочий), ЦветАктивный);
КонецПроцедуры

Функция СвойстваЯчейки(Верх,Право)
	Соотв=ЗначениеИзСтрокиВнутр(СоответствиеСменИСтрок);
	Смена=Соотв.Получить(Верх);
	Если Смена=Неопределено Тогда Возврат Неопределено КонецЕсли;
	
	нВремяНачала=ГраницаНачала+(Право-3)*Периодичность*60;
	нВремяОкончания=нВремяНачала+Периодичность*60;
	
	Если нВремяНачала<ГраницаНачала Или нВремяОкончания>ГраницаОкончания Тогда Возврат Неопределено КонецЕсли;
	
	Возврат Новый Структура("Смена,ВремяНачала,ВремяОкончания",Смена,нВремяНачала,нВремяОкончания)
КонецФункции	

Функция ВхождениеИнтервалаСмены(Смена,НачалоИнтервала)
	Для Каждого Стр Из Смены.НайтиСтроки(Новый Структура("Смена",Смена)) Цикл
		Если Стр.ВремяНачала<=НачалоИнтервала+Периодичность*60/2 И Стр.ВремяОкончания>=НачалоИнтервала+Периодичность*60/2 Тогда //середина интервала должна быть в границах
			Возврат Истина
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь
КонецФункции

Функция КорректировкаДатыОкончания(Дата) Возврат ?(Минута(Дата)=59,Дата+1,Дата) КонецФункции	

&НаКлиенте
Процедура кнСформировать(Команда) Записать() КонецПроцедуры
Процедура Записать()
	
	Записи=РегистрыСведений.Renault_ДополнительныеПараметрыСменыАвтосервиса.СоздатьНаборЗаписей();
	Записи.Прочитать();
	Записи.Очистить();
	Записи.Записать();
	
	//установка новых значений
	Для Каждого Стр Из СобратьОтметки() Цикл
		Запись=РегистрыСведений.Renault_ДополнительныеПараметрыСменыАвтосервиса.СоздатьМенеджерЗаписи();
		Запись.Смена=Стр.Смена;
		Запись.ДилерскийЦентр=ДилерскийЦентр;
		Запись.ВремяНачала=Стр.Период;
		Запись.ВремяОкончания=Стр.Период+Периодичность*60;
		Запись.Записать(Истина);
	КонецЦикла;	
	
КонецПроцедуры

Функция СобратьОтметки()
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Смена");
	ТЗ.Колонки.Добавить("Период");
	
	Если СоответствиеСменИСтрок="" Тогда Возврат ТЗ КонецЕсли; 
	СоотвСмен=ЗначениеИзСтрокиВнутр(СоответствиеСменИСтрок);
	ТекКолонка=3;
	ТекПериод=ГраницаНачала;
	Пока (ТекПериод+Периодичность*60/2)<=ГраницаОкончания Цикл
		Для Каждого Эл Из СоотвСмен Цикл
			Смена=Эл.Значение;
			ТекСтрока=Эл.Ключ;
			Обл=Интервалы.Область("R"+Формат(ТекСтрока,"ЧГ=0")+"C"+Формат(ТекКолонка,"ЧГ=0"));
			Если Обл.ЦветФона=ЦветАктивный Тогда
				Стр=ТЗ.Добавить();	
				Стр.Смена=Смена;
				Стр.Период=ТекПериод;
			КонецЕсли;	
		КонецЦикла;	
		ТекКолонка=ТекКолонка+1;
		ТекПериод=ТекПериод+Периодичность*60;
	КонецЦикла;
	
	Возврат ТЗ
КонецФункции	

&НаКлиенте
Процедура ИнтервалыВыбор(Элемент, Область, СтандартнаяОбработка)
	СвоВа=СвойстваЯчейки(Область.Верх,Область.Право);
	Если СвоВа=Неопределено Тогда 
		Соотв=ЗначениеИзСтрокиВнутр(СоответствиеСменИСтрок);
		Смена=Соотв.Получить(Область.Верх);
		Если Смена<>Неопределено Тогда ОткрытьЗначение(Смена) КонецЕсли;
	Иначе
		Сообщить("Смена "+СвоВа.Смена+", период с "+Формат(СвоВа.ВремяНачала,"ДЛФ=T")+" по "+Формат(СвоВа.ВремяОкончания,"ДЛФ=T"));		
	КонецЕсли;	
КонецПроцедуры
